юв_гит_/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураТЧ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

юв_гит_/src/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикСобытийФормы

&НаКлиенте
Процедура НоменклатураТЧНоменклатураПриИзменении(Элемент)
	ТекСтрокаТЧ = Элементы.НоменклатураТЧ.ТекущиеДанные;
	ТекСтрокаТЧ.ЕдИзм = ПолучитьЕдИзмНаСервере(ТекСтрокаТЧ.Номенклатура);
	//ТекСтрокаТЧ.Цена = ПолучитьЦенуНаСервере(Объект.Дата,ТекСтрокаТЧ.Номенклатура,Объект.Поставщик); 
	РасчетСуммыСтроки.СуммаСтрокиТЧ(ТекСтрокаТЧ);
КонецПроцедуры 

Функция ПолучитьЕдИзмНаСервере(Номенклатура)
	 Возврат Номенклатура.ЕдИзм;
КонецФункции

&НаКлиенте
Процедура НоменклатураТЧКоличествоПриИзменении(Элемент)
    ТекСтрокаТЧ = Элементы.НоменклатураТЧ.ТекущиеДанные;
	РасчетСуммыСтроки.СуммаСтрокиТЧ(ТекСтрокаТЧ);
КонецПроцедуры

#КонецОбласти
